; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	image1 - mode
	image0 - mode
	thermograph2 - mode
	GroundStation4 - direction
	GroundStation3 - direction
	GroundStation2 - direction
	Star1 - direction
	GroundStation0 - direction
	Star5 - direction
	Planet6 - direction
	Star7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 thermograph2)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star10)
	(supports instrument2 image0)
	(supports instrument2 image1)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 Star1)
	(supports instrument3 image1)
	(supports instrument3 image0)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 GroundStation0)
	(supports instrument4 image1)
	(supports instrument4 image0)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 GroundStation0)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation2)
)
(:goal (and
	(pointing satellite0 Star5)
	(pointing satellite1 Star7)
	(have_image Star5 image0)
	(have_image Planet6 image0)
	(have_image Star7 image1)
	(have_image Star8 thermograph2)
	(have_image Phenomenon9 thermograph2)
	(have_image Star10 image0)
	(have_image Phenomenon11 image1)
	(have_image Phenomenon12 image1)
))

)

; plan
1. (turn_to satellite1 star1 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 star1)
   goals met: 0 of 10
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 10
3. (calibrate satellite1 instrument2 star1)
   added: (calibrated instrument2)
   goals met: 0 of 10
4. (turn_to satellite1 phenomenon9 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 phenomenon9)
   goals met: 0 of 10
5. (take_image satellite1 phenomenon9 instrument2 thermograph2)
   added: (have_image phenomenon9 thermograph2)
   goals met: 1 of 10
6. (turn_to satellite1 phenomenon12 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 phenomenon12)
   goals met: 1 of 10
7. (take_image satellite1 phenomenon12 instrument2 image1)
   added: (have_image phenomenon12 image1)
   goals met: 2 of 10
8. (turn_to satellite1 phenomenon11 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 phenomenon11)
   goals met: 2 of 10
9. (turn_to satellite0 star5 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star5)
   goals met: 3 of 10
10. (take_image satellite1 phenomenon11 instrument2 image1)
   added: (have_image phenomenon11 image1)
   goals met: 4 of 10
11. (turn_to satellite1 planet6 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 planet6)
   goals met: 4 of 10
12. (take_image satellite1 planet6 instrument2 image0)
   added: (have_image planet6 image0)
   goals met: 5 of 10
13. (turn_to satellite1 star10 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 star10)
   goals met: 5 of 10
14. (take_image satellite1 star10 instrument2 image0)
   added: (have_image star10 image0)
   goals met: 6 of 10
15. (turn_to satellite1 star5 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star5)
   goals met: 6 of 10
16. (take_image satellite1 star5 instrument2 image0)
   added: (have_image star5 image0)
   goals met: 7 of 10
17. (turn_to satellite1 star8 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 star8)
   goals met: 7 of 10
18. (take_image satellite1 star8 instrument2 thermograph2)
   added: (have_image star8 thermograph2)
   goals met: 8 of 10
19. (turn_to satellite1 star7 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star7)
   goals met: 9 of 10
20. (take_image satellite1 star7 instrument2 image1)
   added: (have_image star7 image1)
   goals met: 10 of 10
